// init.c
#include <avr/io.h>
//*************************************************************************
extern volatile unsigned char Buf_out[8]; // буфер передатчика
extern volatile unsigned char code;	        //Тип игры
extern volatile unsigned char w_cont; // указатель записываемых данных.
//*************************************************************************
void init_pr(void);
void Init_dat_r33(void); // настройка прерываний на работу в режиме теста
//*************************************************************************
void init_pr(void)
{
	// настройка портов
	DDRB=0x010;
	DDRC=0;  			// порт на ввод
	DDRD=0;  			// порт на ввод
	// устанавливаем порты
	PORTB=0xEF; 
	PORTC=0xff;
	PORTD=0xff;
	PRR=0x85;    		//Отключить модули TWI,SPI,АЦП
	// настраиваем таймер 1
	TCCR1A=0;	    	//	Настройка таймера Т1 с периодом вызова
	TCCR1C=0;	    	//	прерываний по совпадению A 16,0 сек 
	OCR1AH=0xf4;	    //	Регистр совпадения А таймера/счётчика Т1 ст. байт
	OCR1AL=0x23;	    //	Регистр совпадения А таймера/счётчика Т1 мл. байт
	TCCR1B=0x0d;	    //	Пуск таймера/счётчика Т1   
	//Инициализация таймера Т2 
	TCCR2A=0x02;		//Настройка таймера Т2 с периодом вызова
	OCR2A=0xc3;			//прерываний по совпадению A 50,0 мс	
	// настройка прерываний по выводам.
	EICRA=(1<<ISC01)|(1<<ISC11); // Прерывание от INT0,INT1 по спаду
	Init_dat_r33();
}

void Init_dat_r33(void) // настройка прерываний на работу в режиме теста
{
	code=0x33;
	EIMSK=(1<<INT0)|(1<<INT1);
	EIFR=0;	
	PCMSK2=(1<<PCINT23);
	PCMSK1=(1<<PCINT11);
	PCMSK0=(1<<PCINT3);
	PCICR=(1<<PCIE2)|(1<<PCIE1)|(1<<PCIE0);
	PCIFR=0;	
	TCCR2B=0;		    //Стоп таймера/счётчика Т2
	Buf_out[0]=0x33;
	Buf_out[1]=0x03;
	Buf_out[3]=0;
	Buf_out[4]=0;
	w_cont=7;
}
